; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v10 ?v8)
             (pred_10 ?v12 ?v9)
             (pred_2 ?v10 ?v9)
             (pred_5 ?v5 ?v10 )
	     (pred_8 ?v10)
             (pred_7 ?v1)
             (pred_11 ?v12)
             (pred_4 ?v9)
             (pred_1 ?v10)
             (pred_9 ?v12)
             (pred_3 ?v10)
             (pred_12 ))



(:action op_1
:parameters (?v4 ?v7 ?v13 ?v3)
:precondition (and (pred_7 ?v4) (pred_7 ?v7) (pred_11 ?v13) (pred_4 ?v3)
          (pred_6 ?v4 ?v7) (pred_10 ?v13 ?v3)
                   (pred_2 ?v7 ?v3) (pred_8 ?v4) 
                   (pred_1 ?v7) (pred_9 ?v13))
:effect (and  (pred_3 ?v7) (not (pred_1 ?v7))))


(:action op_2
:parameters (?v4 ?v11)
:precondition (and (pred_7 ?v4) (pred_7 ?v11)
               (pred_8 ?v4) (pred_6 ?v4 ?v11) (pred_3 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v4))))

(:action op_4
:parameters (?v4 ?v13)
:precondition (and (pred_7 ?v4) (pred_11 ?v13) 
                  (pred_8 ?v4) (pred_5 ?v13 ?v4) (pred_12 ))
:effect (and (pred_9 ?v13)
   (not (pred_5 ?v13 ?v4)) (not (pred_12 ))))


(:action op_3
:parameters (?v4 ?v6 ?v2)
:precondition (and (pred_7 ?v4) (pred_11 ?v6) (pred_11 ?v2)
                  (pred_8 ?v4) (pred_9 ?v2) (pred_5 ?v6 ?v4))
:effect (and (pred_9 ?v6) (pred_5 ?v2 ?v4)
        (not (pred_9 ?v2)) (not (pred_5 ?v6 ?v4))))

(:action op_5
:parameters (?v4 ?v13)
:precondition (and (pred_7 ?v4) (pred_11 ?v13) 
                  (pred_8 ?v4) (pred_9 ?v13))
:effect (and (pred_12 ) (pred_5 ?v13 ?v4) (not (pred_9 ?v13)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_11 obj_20 obj_19 obj_08 obj_05 obj_10 obj_04 obj_01 obj_06 obj_21 obj_12 obj_17 obj_02 obj_18 obj_13
    obj_15 obj_16
    obj_09 obj_03 obj_07
    )

    (:init
       (pred_12)

       (pred_7 obj_14)
       (pred_7 obj_11)
       (pred_7 obj_20)
       (pred_7 obj_19)
       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_7 obj_10)
       (pred_7 obj_04)
       (pred_7 obj_01)
       (pred_7 obj_06)
       (pred_7 obj_21)
       (pred_7 obj_12)
       (pred_7 obj_17)
       (pred_7 obj_02)
       (pred_7 obj_18)
       (pred_7 obj_13)
       (pred_4 obj_15)
       (pred_4 obj_16)
       (pred_11 obj_09)
       (pred_11 obj_03)
       (pred_11 obj_07)

       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_11)
       (pred_6 obj_11 obj_05)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_14)
       (pred_6 obj_20 obj_10)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_19 obj_04)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_11)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_10 obj_21)
       (pred_6 obj_10 obj_04)
       (pred_6 obj_10 obj_20)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_04 obj_19)
       (pred_6 obj_04 obj_10)
       (pred_6 obj_01 obj_17)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_08)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_21)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_21 obj_18)
       (pred_6 obj_21 obj_12)
       (pred_6 obj_21 obj_10)
       (pred_6 obj_21 obj_06)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_12 obj_21)
       (pred_6 obj_17 obj_02)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_02 obj_18)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_17)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_18 obj_21)
       (pred_6 obj_18 obj_02)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_19)
       (pred_1 obj_06)
       (pred_2  obj_13 obj_15)
       (pred_2  obj_19 obj_16)
       (pred_2  obj_06 obj_15)
       (pred_3 obj_14)
       (pred_3 obj_11)
       (pred_3 obj_20)
       (pred_3 obj_08)
       (pred_3 obj_05)
       (pred_3 obj_10)
       (pred_3 obj_04)
       (pred_3 obj_01)
       (pred_3 obj_21)
       (pred_3 obj_12)
       (pred_3 obj_17)
       (pred_3 obj_02)
       (pred_3 obj_18)

       (pred_10  obj_09 obj_15)
       (pred_10  obj_03 obj_16)
       (pred_10  obj_07 obj_15)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_03 obj_08)
       (pred_5 obj_07 obj_10)
       (pred_8 obj_14)
    )

    (:goal (and
       (pred_5 obj_03 obj_01)
       (pred_5 obj_07 obj_21)
    ))
(:constraints
  (always (not (pred_8 obj_05)))
)
)

; plan
1. (op_2 obj_14 obj_08)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_08)
   goals met: 0 of 2
2. (op_4 obj_08 obj_03)
   deleted: (pred_5 obj_03 obj_08) (pred_12)
   added: (pred_9 obj_03)
   goals met: 0 of 2
3. (op_2 obj_08 obj_01)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_01)
   goals met: 0 of 2
4. (op_5 obj_01 obj_03)
   deleted: (pred_9 obj_03)
   added: (pred_12) (pred_5 obj_03 obj_01)
   goals met: 1 of 2
5. (op_2 obj_01 obj_08)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_08)
   goals met: 1 of 2
6. (op_2 obj_08 obj_14)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_14)
   goals met: 1 of 2
7. (op_2 obj_14 obj_11)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_11)
   goals met: 1 of 2
8. (op_2 obj_11 obj_20)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_20)
   goals met: 1 of 2
9. (op_2 obj_20 obj_10)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_10)
   goals met: 1 of 2
10. (op_4 obj_10 obj_07)
   deleted: (pred_5 obj_07 obj_10) (pred_12)
   added: (pred_9 obj_07)
   goals met: 1 of 2
11. (op_2 obj_10 obj_21)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_21)
   goals met: 1 of 2
12. (op_5 obj_21 obj_07)
   deleted: (pred_9 obj_07)
   added: (pred_12) (pred_5 obj_07 obj_21)
   goals met: 2 of 2
